#ifndef _REGISTERS_H_
#define _REGISTERS_H_
#include <stdint.h>

// DO NOT EDIT THIS FILE. This output is automated and any changes will be overwritten.
// It uses the RoverApi2.Registers+StepperRegister enum as input
typedef enum {
  MOT_TargetPosition=0,
  MOT_ActualPosition=1,
  MOT_TargetSpeed=2,
  MOT_ActualSpeed=3,
  MOT_MaxPositionSpeed=4,
  MOT_MaxAcceleration=5,
  MOT_MaxCurrent=6,
  MOT_StandbyCurrent=7,
  MOT_PositionReached=8,
  MOT_HomeSwitch=9,
  MOT_RightLimitSwitch=10,
  MOT_LeftLimitSwitch=11,
  MOT_RightLimitDisable=12,
  MOT_LeftLimitDisable=13,
  MOT_SwapLimitSwitches=14,
  MOT_AccelerationA1=15,
  MOT_VelocityV1=16,
  MOT_MaxDeceleration=17,
  MOT_DecelerationD1=18,
  MOT_VelocityVStart=19,
  MOT_VelocityVStop=20,
} StepperRegister_t;

#define MAX_REGISTER_NUMBER_StepperRegister 20
#define NUM_REGISTERS_StepperRegister 21
typedef struct {
 int32_t TargetPosition; // 0
 int32_t ActualPosition; // 1
 int32_t TargetSpeed; // 2
 int32_t ActualSpeed; // 3
 int32_t MaxPositionSpeed; // 4
 int32_t MaxAcceleration; // 5
 int32_t MaxCurrent; // 6
 int32_t StandbyCurrent; // 7
 int32_t PositionReached; // 8
 int32_t HomeSwitch; // 9
 int32_t RightLimitSwitch; // 10
 int32_t LeftLimitSwitch; // 11
 int32_t RightLimitDisable; // 12
 int32_t LeftLimitDisable; // 13
 int32_t SwapLimitSwitches; // 14
 int32_t AccelerationA1; // 15
 int32_t VelocityV1; // 16
 int32_t MaxDeceleration; // 17
 int32_t DecelerationD1; // 18
 int32_t VelocityVStart; // 19
 int32_t VelocityVStop; // 20
} StepperRegisters_t;

#endif //_REGISTERS_H_
